Revit 2024 API
Space.BaseOffset Property
Get or set the Base Offset of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double BaseOffset { get; set; }
Visual Basic
Public Property BaseOffset As Double
	Get
	Set
Visual C++
public:
property double BaseOffset {
	double get ();
	void set (double value);
}
Remarks
This property is used to get or set the Base Offset of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace